pwg-pwg/test/1.IVCM_LV/IVCM_F2800157_IAP/01_SourceCode/F2800157_IAP.si4project/Backup/Main(307).h
/********************************************************************************
Right Reserve:  Guangzhou Felicity Solar Technology Co., Ltd
Project:        IVCM1012
File Name:      Main.h
Author:         IVCM1012 Team
Date:           2023.05.04
Description:    None
********************************************************************************/
#ifndef __MAIN_H__
#define __MAIN_H__

/********************************************************************************
* Include head files                                                            *
********************************************************************************/
#include 	<string.h>
#include 	<stdint.h>
#include 	<stdbool.h>

#include 	"f280015x_device.h"
#include 	"f280015x_examples.h"

#include 	"kernel.h"

#include 	"math.h"				// 标准运算库
#include 	"IQmathLib.h"			// 定点运算库
#include 	"Library.h"

#include 	"pin_map.h"
#include 	"hw_gpio.h"
#include 	"hw_memmap.h"
#include 	"hw_types.h"
#include 	"hw_can.h"
#include 	"hw_sysctl.h"

#include 	"device.h"

#include 	"interrupt.h"
#include 	"Initial.h"

#include 	"ParallelJob.h"
#include 	"InterfaceJob.h"
#include 	"DisplayJob.h"
#include 	"IdleJob.h"

#include	"FlashTech_F280015x_C28x.h"
#include	"flash_programming_f280015x.h"
#include	"BootLoad.h"

/********************************************************************************
* Macros                                                                        *
********************************************************************************/
// Task priority define
#define cPrioParallel                   0
#define cPrioInterface                  1
#define cPrioDisplay                    2
#define cPrioIdle                       3
#define cPrioTaskEnd                    4

// Task stack size define
#define cMaxParallelJobTaskSize         300
#define cMaxInterfaceJobTaskSize        300
#define cMaxDisplayJobTaskSize          300
#define cMaxIdleJobTaskSize             300

// Task timer define
#define cTimer1ms                       2
#define cTimer2ms                       4
#define cTimer5ms                       10
#define cTimer8ms                       16
#define cTimer10ms                      20
#define cTimer20ms                      40
#define cTimer50ms                      100
#define cTimer100ms                     200


// BUSBATPROT task event define
#define eGeneralTimer                   0

// PARALLEL task event define
#define eParallelTimer                  0
#define eParallelCANParsing             1
#define eParaToLineMode                 2
#define eParaToBatMode                  3
#define eParaToStandbyMode              4
#define eParaToFaultMode                5
#define eParaToBypassMode               6
#define eParaToShutDownMode             7
#define eParaOPRlyOn                    8
#define eParaOPRlyOff                   9
#define eParaBusSoftOn                  10
#define eParaToMasterRelease            11
#define eParaSYNLineLoss                12
#define eParaDataSet                    13
#define eParaSelectPoint                15

// INTERFACE task event define
#define eInterfaceTimer                 0
#define eEepromTimer                    eInterfaceTimer
#define eI2CEEpromUserSave              1
#define eI2CEEpromUser2Save             2
#define eI2CEEpromUser3Save             3
#define eI2CEEpromFacSave               4
#define eI2CEEpromFac2Save              5
#define eMCUDSPDataParsing              6
#define eEepromSaveCounter              7
#define eEepromSaveKeyNum               8
#define eEepromWaitTime                 9
#define eEepromSaveSetDate              10
#define eMPPTParsing                     11
#define e485Parsing                     12
#define e232Parsing                     13

// DISPLAY task event define
#define eDisplayTimer                   0

// IDLE task event define
#define eIdleTimer                      0


/********************************************************************************
* Routines' implementations                                                     *
********************************************************************************/


/********************************************************************************
* Output interface Routines                                                     *
********************************************************************************/


/********************************************************************************
* Input interface Routines                                                      *
********************************************************************************/


#endif  // __MAIN_H__

